backend/artillery-load-test.yml
config:
  target: 'http://localhost:5000'

  phases:
    - duration: 30
      arrivalRate: 3
      name: "Warm up"

    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: "Ramp up"

    - duration: 120
      arrivalRate: 10
      name: "Sustained load"

    - duration: 30
      arrivalRate: 3
      name: "Cool down"

  http:
    timeout: 10

  variables:
    ngoId: '69d8c75fa08eb181667065fc'
    projectId: '69d8c8dba3f6f280f1027d18'

    resourceId: 'mock-resource-001'
    corporateId: 'mock-corporate-001'
    corporateEmail: 'corporate@example.com'
    corporatePassword: 'TestPass123!'

scenarios:
  - name: "Public - Browse Projects"
    weight: 100
    flow:
      - get:
          url: "/api/projects/all"
          expect:
            - statusCode: 200
            - contentType: json

      - think: 2

      - get:
          url: "/api/projects/{{ projectId }}"
          expect:
            - statusCode: 200
            - contentType: json

      - think: 1

      - get:
          url: "/api/projects/ngoprojects/{{ ngoId }}"
          expect:
            - statusCode: 200
            - contentType: json

      - think: 2