backend/artillery-load-test.yml
config:
  target: 'http://localhost:5000'

  phases:
    - duration: 30
      arrivalRate: 3
      name: "Warm up"

    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: "Ramp up"

    - duration: 120
      arrivalRate: 10
      name: "Sustained load"

    - duration: 30
      arrivalRate: 3
      name: "Cool down"

  http:
    timeout: 10

  variables:
    ngoId: '69d8c75fa08eb181667065fc'
    projectId: '69d8c8dba3f6f280f1027d18'
    # Add credentials for the authenticated test
    corpEmail: 'corporate@example.com'
    corpPassword: 'TestPass123!'


scenarios:
  - name: "Public - Browse Projects"
    weight: 100
    flow:
      - get:
          url: "/api/projects/all"
          expect:
            - statusCode: 200
            - contentType: json

      - think: 2

      - get:
          url: "/api/projects/{{ projectId }}"
          expect:
            - statusCode: 200
            - contentType: json

      - think: 1

      - get:
          url: "/api/projects/ngoprojects/{{ ngoId }}"
          expect:
            - statusCode: 200
            - contentType: json

      - think: 2

      # --- NEW: Corporate Actions (Authenticated + Write) ---
  - name: "Corporate - Login & Create Proposal"
    weight: 30 # 30% of users perform actions
    flow:
      # 1. Login
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ corpEmail }}"
            password: "{{ corpPassword }}"
          capture:
            - json: "$.token"
              as: "auth_token"
            - json: "$.data.token"
              as: "auth_token_fallback"
          expect:
            - statusCode: 200
      
      - think: 1
# 2. View My Proposals
      - get:
          url: "/api/proposals/my"
          headers:
            Authorization: "Bearer {{ auth_token || auth_token_fallback }}"
          expect:
            - statusCode: 200

      - think: 2

      # 3. Create a New Proposal (Write Operation)
      - post:
          url: "/api/proposals"
          headers:
            Authorization: "Bearer {{ auth_token || auth_token_fallback }}"
          json:
            projectId: "{{ projectId }}"
            proposalTitle: "Performance Test Proposal"
            description: "Generated by Artillery load test"
            amount: 5000
            expectedImpact: "System stress test"
            message: "Auto-generated"
            priority: "Medium"
          expect:
            - statusCode: 201
            - statusCode: 400 # Accept validation errors if ID is bad
            - statusCode: 401 # Accept auth errors if token fails
      
      - think: 3